{
  "en-US": "English",
  "ja-JP": "Japanese",
  "zh-CN": "Chinese",
  "languages": "Languages",
  "name": "Shuichi Nagao",

  "career-title": "Career Summary",
  "career-updated-at": "Last edited | March 14th, 2020",
  "career-description": "Entered the University of Tokyo in April of 2012, where Shuichi had been dedicated himself to lacrosse and studying for the whole 4 years. Shuichi majored in software engineering, and got fascinated in building products though programming at that time. Although he proceeded to a graduate school at the University of Tokyo in April of 2016, he decided to leave there in one year since he had determined to work for a startup company AnyPay, which provided payment service to customers, as a software engineer. Since fall of 2017, he had been involved in blockchain projects at AnyPay for over one year.\n\nIn November of 2018, as Shuichi started to want to expose himself to global environments, he left AnyPay and explored around South East Asia.\n\nIn May of 2019, Shuichi decided to start Credify as a co-founder to create a new way to enhance credibility in digital economies.",
  "career-title-university-entry": "April, 2012 | Entered the University of Tokyo",
  "career-university-entry1": "Studied liberal arts in scientific class",
  "career-university-entry2": "Proceeded to the department of System Innovation, Engineering faculty.",
  "career-internship-candle": "In December of 2015, Shuichi started an internship as a software engineer, which drove him to learn programming extremely hard.",
  "career-title-university-graduation": "March, 2016 | Graduated from the University of Tokyo",
  "career-university-graduation": "Graduated from the University of Tokyo",
  "career-title-gradschool-entry": "April, 2016 | Entered Graduate School (the University of Tokyo)",
  "career-gradschool-entry": "At that time Shuichi was fascinated with startup, therefore he took a 1-year leave at the graduate school and dedicated himself to software engineering to create apps. Through some internships (e.g. Mercari, Candle), he determined to officially join a startup company not for internship.",
  "career-title-gradschool-dropout": "March, 2017 | Left Graduate School (the University of Tokyo)",
  "career-title-anypay-entry": "April, 2017 | Joined AnyPay Inc.",
  "career-anypay-entry1": "Shuichi joined AnyPay Inc. as literally the first iOS developer. In summer of 2017, he started to develop the backend of a new project with Ruby. Since its fall he had been involved in another new project related to blockchain. He used React Native for the project because most of blockchain-related libraries are written in JavaScript first.",
  "career-title-anypay-resign": "November, 2018 | Resigned from AnyPay Inc.",
  "career-anypay-resign": "",
  "career-title-pandai-entry": "December, 2018 | Worked for Pand.ai",
  "career-pandai-entry": "Shuichi led the development of chatbot web admin systems.",
  "career-title-pandai-resign": "May, 2019 | Left from Pand.ai",
  "career-pandai-resign": "",
  "career-title-credify-entry": "May, 2019 | Started Credify",
  "career-credify-entry": "",

  "skills-title": "Skills",
  "skills-updated-at": "Last edited | March 14th, 2020",
  "skills-description": "Although Shuichi manages a product team comprised of 5 international developers and designs wireframes and its UIUX these days, he loves coding, such as JavaScript (React.js, React Native, Node.js), Solidity(Ethereum development), Swift(iOS development), and Ruby (Ruby on Rails). Shuichi is brimmed with curiosities in new technologies, including blockchain and machine learning, which he believes will surely be a key driver for innovations.",
  "skills-title-programming": "Programming languages",
  "skills-programming": "Swift / JavaScript(React, React Native, Node.js) / Ruby(Ruby on Rails) / Solidity",
  "skills-title-environments": "Preferences",
  "skills-environments": "Vim > Emacs, Tab > Space",

  "hobby-title": "Hobby / Interest",
  "hobby-updated-at": "Last edited | March 14th, 2020",
  "hobby-description": "Shuichi likes programming, workout, reading books, and traveling, and also is interested in technologies that can change our lives. In China, technologies actually have been changing their lives dramatically, which led him to visit Shenzhen many times. Although he is an engineer, he is strongly interested in business, history, and languages.",
  "hobby-title-travel": "Countries Shuichi visited recently",
  "hobby-travel": "Vietnam, Malaysia, The UK (London/Edinburgh), Singapore, Hong Kong, China（Shenzhen/Shanghai/Hangzhou), Indonesia, Thailand, Cambodia, Israel",
  "interest-title-thesedays": "Recent Shuichi's thoughts",
  "interest-thesedays": "The quantity of information is getting so big that people need to redefine a new interface between offline and online, which will lead innovations.",

  "work-title": "Projects",
  "work-updated-at": "Last edited | March 14th, 2020",
  "work-description": "As an internship Shuichi got involved in media (web, iOS) app development for young women, where he developed not only the frontend but also its backend using AWS.\n\nAfter joining AnyPay, Shuichi worked on a new app called 'paymo', and he was the first full-time iOS developer there, therefore he designed its architecture with a lead Android engineer. He experienced a development in a team of 10+ people, coding highly maintainable unit tests, and refactoring the project from its architecture level. He got involved in a blockchain-related project as well as the payment app project since fall in 2017. He used React Native and Ethereum. In that project as its backend consisted of micro services, he coded Go, Node.js, and Ruby as well as React Native. \n\nIn December of 2018, Shuchi started building a web frontend using React.js & Redux at Pand.ai as a lead frontend developer. He almost rewrote that project from scratch.\n",
  "work-title-credify": "Credify | Trust, Elevated",
  "work-credify": "As a co-founder of Credify, a Singaporean startup company, Shuichi is in charge of product development. He designs products by way of communication with various people and builds them with a development team, which is based out of Saigon.",
  "work-title-pandai": "Pand.ai chatbot for financial institutes",
  "work-pandai": "Shuichi built a web frontend for Pand.ai's clients using React.js and Redux. He contributed to its renewal.",
  "work-title-voltorb": "ICO PICKS | Entrance into the Crypto-World",
  "work-voltorb": "React Native project, with Ethereum. Shuichi got involved in a React Native project from the beginning. He experienced not only development but CICD and maintenance. I interacted with Ethereum (transferring ETH, ERC20 tokens) via web3.js. This project's backend employed micro services, and he coded the backend as well in Go, Node.js, and Ruby.",
  "work-title-paymo": "paymo | P2P payment app",
  "work-paymo": "Back in 2016, The US had 'Venmo', and China had 'WeChat Pay' and 'Alipay', however, despite the strong needs, Japan did not have any well-known apps like those at that time. Shuichi joined AnyPay to develop an app like those, where he went through development in a team of 10+ people, coding highly maintainable tests, and refactoring from an architecture level. Moreover, this app required deep comprehension of Japanese money transfer regulations, which motivated him to study legal issues as well as technologies.",
  "work-title-mimi": "Mimi | Streaming video app for makeup",
  "work-mimi": "Development team consisted of 3 people, and Shuichi was mainly in charge of server-side (admin web app and API), though he started to get involved in this product as an iOS developer. He learned how to improve the performance and OOM.",
  "work-title-marble": "Marble | Content curation for young women",
  "work-marble": "This is Shuichi's very first product as a software engineer. At first, he coded PHP to build websites, and then he started to develop an iOS client app in Swift."
}
