{
  "en-US": "English",
  "ja-JP": "Japanese",
  "zh-CN": "Chinese",
  "languages": "Languages",
  "name": "Shuichi Nagao",

  "career-title": "Career Summary",
  "career-updated-at": "Last edited | April 19th, 2019",
  "career-description": "I entered the University of Tokyo in April of 2012, and spent most of my university days on lacrosse. My major was engineering, and I got interested in programming then. Though I proceeded to graduate school in March of 2016, I dropped out after one year, because I was strongly interested in startup business. After dropping out of school, I entered AnyPay Inc. that runs payment services as a software engineer. Since fall of 2017 I got involved in blockchain, or crypto projects. In December of 2018, I joined Pand.ai, a Singaporean small startup providing a chatbot for big financial institutes as a frontend engineer.",
  "career-title-university-entry": "April, 2012 | Entered the University of Tokyo",
  "career-university-entry1": "Studied liberal arts in scientific class",
  "career-university-entry2": "Proceeded to the department of System Innovation, Engineering faculty.",
  "career-internship-candle": "As of December, 2015, I started an internship as a software engineer, which drove me to learn programming very hard.",
  "career-title-university-graduation": "March, 2016 | Graduated from the University of Tokyo",
  "career-university-graduation": "Graduated from the University of Tokyo",
  "career-title-gradschool-entry": "April, 2016 | Entered Graduate School (the University of Tokyo)",
  "career-gradschool-entry": "At that time I was into startup so I stopped studying in graduate school and dedicated myself to programming to make applications. Through some internships, like Mercari, I decided to officially join startup not for internship.",
  "career-title-gradschool-dropout": "March, 2017 | Left Graduate School (the University of Tokyo)",
  "career-title-anypay-entry": "April, 2017 | Joined AnyPay Inc.",
  "career-anypay-entry1": "I joined AnyPay Inc. as a very first iOS developer. In summer of 2017 I started to develop server-side of a new project with Ruby. Since fall I have been involved in another new project related to crypto. I used React Native because most of crypto libraries comes JavaScript first.",
  "career-title-anypay-resign": "November, 2018 | Resigned from AnyPay Inc.",
  "career-anypay-resign": "",
  "career-title-pandai-entry": "December, 2018 | Joined Pand.ai",
  "career-pandai-entry": "I wanted to challenge myself outside of Japan, and I decided to join Pand.ai, a Singaporean startup in an AI industry. I mainly built a web frontend for our clients using React.js & Redux.",

  "skills-title": "Skills",
  "skills-updated-at": "Last edited | April 19th, 2019",
  "skills-description": "I mainly code JavaScript(React.js, React Native, Node.js), Solidity(Ethereum development), Swift(iOS development), and Ruby (Ruby on Rails). At first, I liked Swift the best, however through development with React Native and Node.js, I have got in favor of JavaScript. Besides I'm interested in new technologies, including blockchain and machine learning, which I believe will be a key for innovation.",
  "skills-title-programming": "Programming languages",
  "skills-programming": "Swift / JavaScript(React, React Native, Node.js) / Ruby(Ruby on Rails) / Solidity",
  "skills-title-environments": "Preferences",
  "skills-environments": "Vim > Emacs, Tab > Space",

  "hobby-title": "Hobby / Interest",
  "hobby-updated-at": "Last edited | January 1st, 2019",
  "hobby-description": "My hobby is programming, workout, books, and travelling. I like technologies that can change our lives. In China, technologies actually have been changing their lives, which allures me to visit Shenzhen many times. Though I'm an engineer, I'm strongly interested in business itself.",
  "hobby-title-travel": "Countries I visited recently",
  "hobby-travel": "Singapore / Indonesia / Vietnam / Thailand / Cambodia / Israel / China（Shenzhen・Shanghai・Hangzhou） / HongKong",
  "interest-title-thesedays": "What interests me these days",
  "interest-thesedays": "The amount of information is getting so big that we need to redefine a new interface between offline and online, which will lead innovations.",

  "work-title": "Projects",
  "work-updated-at": "Last edited | April 19th, 2019",
  "work-description": "As an internship I was involved in media(web, iOS) applications for young women, where I developed not only iOS but backend on AWS. After joining AnyPay Inc., my colleagues and I had been working on a new application called 'paymo'. I was a very first full-time iOS engineer so I designed its architecture with a lead Android engineer. I experienced a development in a team of over 10 people, coding highly maintainable tests, and refactoring from an architecture level. I got involved in a crypto project since fall in 2017. I used React Native and Ethereum. In that project, since its backend consisted of micro services, I coded Go, Node.js, and Ruby as well as React Native. In December of 2018, I started building a web frontend using React.js & Redux at Pand.ai. I almost rewrote that project from scratch.",
  "work-title-pandai": "Pand.ai chatbot for financial institutes",
  "work-pandai": "I built web frontend for Pand.ai's clients using React.js and Redux. I contributed renewal of this web application.",
  "work-title-voltorb": "ICO PICKS | Entrance into the Crypto-World",
  "work-voltorb": "React Native project, with Ethereum. I got involved in a React Native project since from the beginning. I experienced the release, and maintaining it. I interacted with Ethereum(transferring ETH, ERC20 tokens) via web3.js. This project's backend employed micro services, and I coded the backend as well in Go, Node.js, and Ruby.",
  "work-title-paymo": "paymo | P2P payment application",
  "work-paymo": "The US has 'Venmo', China has 'WeChat Pay' and 'Alipay', however, we Japanese have no applications like that, even though it is necessary in this digital age. Therefore we struggled to make it possible through mobile applications, which was our motivation. At AnyPay Inc., I experienced development in a team of over 10 people, coding highly maintainable tests, and refactoring from an architecture level. Besides, this app requires comprehension of Japanese money transfer regulations, which made me study legal issues.",
  "work-title-mimi": "Mimi | Streaming video application for makeup",
  "work-mimi": "Development team consisted of 3 people, and I was mainly in charge of server-side(admin web site and API server), though I started to get involved in this product as an iOS developer. We cared about performance and OOM very much.",
  "work-title-marble": "Marble | Content curation for young women",
  "work-marble": "This is my very first product as an engineer. At first, I coded PHP to make web sites, and then I started to develop an iOS client application in Swift."
}
