{
  "en-US": "English",
  "ja-JP": "Japanese",
  "zh-CN": "Chinese",
  "languages": "Languages",
  "name": "Shuichi Nagao",

  "career-title": "Career Summary",
  "career-updated-at": "Last edited | April 7th, 2018",
  "career-description": "I entered the University of Tokyo in April of 2012, and spent most of my university days on lacrosse. My major was engineering, and I got interested in programming then. Though I proceeded to graduate school in March of 2016, I dropped out after one year, because I was strongly interested in startup business. After dropping out of school, I entered AnyPay Inc. that runs payment services as a software engineer. Since fall of 2017 I have been involved in blockchain, or crypto projects.",
  "career-title-university-entry": "April, 2012 | Entered the University of Tokyo",
  "career-university-entry1": "Studied liberal arts in scientific class",
  "career-university-entry2": "Proceeded to the department of System Innovation, Engineering faculty.",
  "career-internship-candle": "As of December, 2015, I started an internship as a software engineer, which drove me to learn programming very hard.",
  "career-title-university-graduation": "March, 2016 | Graduated from the University of Tokyo",
  "career-university-graduation": "Graduated from the University of Tokyo",
  "career-title-gradschool-entry": "April, 2016 | Entered Graduate School (the University of Tokyo)",
  "career-gradschool-entry": "At that time I was into startup so I stopped studying in graduate school and dedicated myself to programming to make applications. Through some internships, like Mercari, I decided to officially join startup not for internship.",
  "career-title-gradschool-dropout": "March, 2017 | Dropped out from Graduate School (the University of Tokyo)",
  "career-title-anypay-entry": "April, 2017 | Joined AnyPay Inc.",
  "career-anypay-entry1": "I joined AnyPay Inc. as a very first iOS developer. In summer I started to develop server-side of a new project with Ruby. Since fall I have been involved in another new project related to crypto. Currently I am coding React Native.",

  "skills-title": "Skills",
  "skills-updated-at": "Last edited | October 14th, 2018",
  "skills-description": "I mainly code JavaScript(React Native / node.js), Solidity(Ethereum development), or Swift(iOS development). At first, I liked Swift the best, however through development with React Native and node.js, I'm getting in favor of JavaScript. Besides I'm interested in blockchain, therefore I code smart contract with Solidity for our project. And also, I'm writing a book about blockchain engineering in Japanese.",
  "skills-title-programming": "Programming languages",
  "skills-programming": "Swift / JavaScript(React, React Native, node.js) / Ruby(Ruby on Rails) / Solidity / Go",
  "skills-title-environments": "OS",
  "skills-environments": "MacOS / Linux",

  "hobby-title": "Hobby / Interest",
  "hobby-updated-at": "Last edited | October 14th, 2018",
  "hobby-description": "My hobby is programming, reading books, workout, and travelling. In weekends, I help startups to develop products, or study blockchain which changes so fast which attracts me. Recently, I started living in Singapore, where I have to catch up with fincance, I started studying finance. I like technology that changes our lives. In China, technology actually has been changing their lives, which allures me to visit Shenzhen many times.",
  "hobby-title-travel": "Countries I visited recently",
  "hobby-travel": "Vietnam / Thailang / Cambodia / Singapore / Israel / China（Shenzhen・Shanghai・Hangzhou） / HongKong",
  "hobby-title-blockchain": "Favorite blockchains",
  "hobby-blockchain": "Ethereum / NEO / EOS",
  "interest-title-thesedays": "What interests me these days",
  "interest-thesedays": "What blockchain creates, which is not pictured in any Si-Fi movies. The Internet itself made it possible to distribute information, on the other hand blockchain can distribute value, which is so interesting that I'm into it. Since this August I started living in Singapore, so I often visit countries around Singapore. Everytime I visit countries in East Asia, I feel that sharing economy is getting more important for economics in those countries because it will boost economic growth, so I'm looking for what I can do for it.",

  "work-title": "Projects",
  "work-updated-at": "Last edited | June 2nd, 2018",
  "work-description": "As an intern I was involved in media(web, iOS) applications for young women, where I developed not only iOS but backend and AWS. After joining AnyPay Inc., my colleagues and I had been working on a new application called 'paymo' to make it an internal project. I experienced work flow with more than 8 people, coding highly maintainable tests, and refactoring from architecture. I was involved in crypto space since fall in 2017, technically, I use React Native and Ethereum. In that project, as the backend consists of micro services, I code Go, node.js, or Ruby when backend task is stuck.",
  "work-title-voltorb": "ICO PICKS | Entrance into the Crypto-World",
  "work-voltorb": "React Native project, with Ethereum. I started being involved in React Native project since it started. I experienced the release of it, currently I maintenance it. I interact with Ethereum(transferring ETH, ERC20 tokens) via web3.js. This project's backend is micro services, and I code the backend as well in Go, node.js, or Ruby.",
  "work-title-paymo": "paymo | P2P payment application",
  "work-paymo": "The US has 'Venmo', China has 'WeChat Pay' and 'Alipay', however, we Japanese have no applications like that, even though it is necessary in this digital age. Therefore we struggle to make it possible through mobile applications, which is our motivation. At AnyPay Inc., I experienced work flow with more than 8 people, coding highly maintainable tests, and refactoring from architecture. Besides, this app requires comprehension of Japanese money transfer legals, which made me study legal issues.",
  "work-title-mimi": "Mimi | Streaming video application for makeup",
  "work-mimi": "Development team consisted of 3 people, and I was mainly in charge of server-side(admin web site and API server), though I started to get involved in this product as an iOS developer. We cared about performance and OOM very much.",
  "work-title-marble": "Marble | Content curation for young women",
  "work-marble": "This is my very first product as an engineer. At first, I coded PHP to make web sites, and then I started to develop an iOS client application in Swift."
}
